// THIS IS A TEMPLATE FILE. IT WILL HAVE NO EFFECT ON THE GAME AND WILL BE OVERRIDEN ON EVERY UPDATE.
// TO USE CUSTOM CONFIG, COPY THIS FILE, NAME IT Config.json AND EDIT VALUES TO YOUR LIKING
{
    //Light options

    /* VISUAL */
    //Amount of Lux at which the world cell will be considered as fully lit (visually)
    "LuxThreshold": 1800,

    //The lowest brightness of the world's darkness. 0 = fully black. 255 = normal lighting
    "LowestFog": 30,

    //The highest brightness of the world's darkness. 0 = fully black. 255 = normal lighting
    "HighestFog": 255,

    /* GAMEPLAY */

    //How much lux is needed for the decor from light. Game default: 1
    "LitDecorLux": 1000,

    //How much lux (+1) is needed for the Lit Workspace buff. Game default value: 0. Warning: light emitted by dupes counts.
    "LitWorkspaceLux": 999,

    //Maximum lux is before dupe's sleep is interrupted. Game default value: 0. Warning: light emitted by dupes counts.
    "DisturbSleepLux": 500,

    //Whether dupe emits light around it (range: 3). Values: true or false (LOWERCASE!)
    "DupeLight": false,

    //If true, how much lux should the dupe emit. Keep in mind this does affect actual brightness so adjust the buff thresholds.
    "DupeLightLux": 200,

    //Whether atmo suits and jet suits emit light
    "SuitLight": true,

    //If true, how much lux should the suit emit.
    "SuitLightLux": 2000,

    //The level of "consequences" for unlit areas.
    //Possible values: 0, 1, 2

    //NONE: 0 - the debuffs will apply no negative stats
    //LIGHT: 1 - the "Dark" debuff applies -3 to Athletics and -2 to all other attributes. "Pitch Black" applies -5 to Athletics and -3 to all other attributes.
    //HARSH: 2 - the "Dark" debuff applies -5 to Athletics and -3 to all other attributes. "Pitch Black" applies -10 to Athletics and -5 to all other attributes.
    "DebuffTier": 1,
    "PitchBlackLuxThreshold": 0,
    "DarkLuxThreshold": 1000
}
